{
  "randomTips": [
    {
      "title": "Budget to zero before the month begins",
      "description": "This means before the month even starts, you’re making a plan and giving every dollar a name. It’s called a zero-based budget. Now that doesn’t mean you have zero dollars in your bank account. It just means your income minus all your expenses (outgo) equals zero."
    },

    {
      "title": "Do the budget together",
      "description": "If you’re married, sit down once a month and have a family budgeting night. Make it fun! Grab some of your favorite snacks and put on a good playlist to help you focus. You need to get on the same page with money, so set goals together and dream about what the future will look like. Remember: If the two of you are one, your bank accounts should be one too! It’s no longer your money or my money—it’s our money. And if you’re single, find someone who can act as your accountability partner and help you stick to your goals!"
    },

    {
      "title": "Every month is different",
      "description": "Some months you’ll have to budget for things like back-to-school supplies or routine car maintenance. Other months you’ll be saving for things like vacations, birthdays and holidays. Regardless of the occasion, make sure you prepare for those expenses in the budget. Don’t let these special occasions sneak up on you. (Hint: Christmas is in December again this year, guys!) Be sure to adjust your budget each month as things change. Make a savings fund you can stash cash in throughout the year. When you don’t have a plan, you’re going to be stressed. And that takes all the fun out of giving and celebrating. No one wants that!"
    },

    {
      "title": "Start with the most important categories first",
      "description": "Giving and saving are at the top of the list, and then comes the Four Walls—food, shelter and utilities, basic clothing and transportation. Once your true necessities are taken care of, you can fill in the rest of the categories in your budget."
    },

    {
      "title": "Pay off your debt",
      "description": "If you have debt, paying it off needs to be a top priority. Use the debt snowball method and the Baby Steps to get rid of debt as fast as you can. Attack it! Get mad at it! Stop letting debt rob you of the very thing that helps you win with money—your income."
    },

    {
      "title": "Don’t be afraid to trim the budget",
      "description": "Brace yourself! It might be time for some budget cuts in your life. If things are tight right now, you can save money quickly by canceling your cable, dining out less, and shopping at discount clothing and grocery stores. Remember, your budget cuts are only temporary. You can always make adjustments later down the road."
    },

    {
      "title": "Make a schedule (and stick to it)",
      "description": "While you’re making a budget part of your monthly routine, why not pick specific dates for other expenses? Set up auto drafts out of your checking account to pay bills, and buy your groceries on a set day every week or twice a month. When you know what to expect and when to expect it, you take a lot of stress and potential pitfalls out of the picture."
    },

    {
      "title": "Track your progress",
      "description": "It’s important to check your progress from time to time. If you’re married, track your spending and purchases together so you both keep your goals in sight. Look back at your earlier budgets to see how far you’ve come. And don’t forget to celebrate the small wins. (Pro tip: One key category to keep a close eye on is your grocery budget. I bet you are spending significantly less on groceries on a budget.)"
    },

    {
      "title": "Create a buffer in your budget",
      "description": "Put a small amount of money aside for unexpected expenses throughout the month. Label this as your miscellaneous category in your budget. That way when something comes up, you can cover it without taking away money you’ve already put somewhere else. Keep track of expenses that frequently end up in this category. Eventually, you might even want to promote them to a permanent spot on the budget roster."
    },

    {
      "title": "Cut up your credit cards",
      "description": "If you’re really committed to sticking to a budget and getting out of debt, you need to ditch those credit cards for good. Stop using them! Cut them up, shred them, or even make a craft project out of them! Whatever you do—get them out of your life. Having no credit card debt will mean no more minimum payments to add to the budget, zero hassle with fees or high interest rates, and much less stress and worry! Stick to using your debit card (and even cash!), and dump those credit cards like your ninth-grade fling. You know what the great thing about a debit card is? The money comes straight out of your bank account! There’s no middleman charging you 15% interest."
    },

    {
      "title": "Use cash for certain budget categories that trip you up",
      "description": "If you’re constantly overspending on your grocery budget or fun money, cash out those categories and use the envelope system to hold you accountable. Just go to the bank and pull out the cash amount you’ve budgeted for that category. Once the cash runs out, stop spending! It’s the ultimate accountability partner."
    },

    {
      "title": "Try an online budget tool",
      "description": "If pen and paper (or spreadsheets) aren’t your thing, it’s time to join the 21st century and use a budgeting tool like EveryDollar. You can focus on planning a budget and tracking your spending from the comfort of your smartphone! Plus, you can sync up your budget with your spouse, which is great for keeping that communication open."
    },

    {
      "title": "Be content and quit the comparisons",
      "description": "You have much more than you realize. Don’t compare your situation to anyone else’s. Comparison will not only rob you of your joy but also your paycheck. Keep moving forward and doing what’s right for your family."
    },

    {
      "title": "Have goals",
      "description": "Whether you’re paying off student loans, building up your emergency fund, or paying off your mortgage, you need to focus on your why. What’s the reason you’re making these sacrifices?"
    },

    {
      "title": "Give yourself lots of grace",
      "description": "It usually takes three to four months to get a handle on this whole budgeting thing. It won’t be perfect the first time, or the second. But you’ll get there!"
    }
  ]
}
